In [4]:
import pandas as pd

In [6]:
df=pd.read_csv('boxoffice_data_2024.csv')

In [8]:
print(df)

      Year                                          Title         Gross
0     1984                              Beverly Hills Cop  $234,760,478
1     1984                                   Ghostbusters  $229,376,332
2     1984           Indiana Jones and the Temple of Doom  $179,876,727
3     1984                                       Gremlins  $148,171,538
4     1984                                 The Karate Kid   $90,817,155
...    ...                                            ...           ...
8140  2024                            Irklais per Atlanta    $1,402,306
8141  2024                                     Bramayugam    $1,388,375
8142  2024                                  White Courage    $1,373,237
8143  2024  National Theatre Live: The Motive and the Cue    $1,338,772
8144  2024                            Escape from Germany    $1,321,364

[8145 rows x 3 columns]

In [14]:
df1=pd.read_csv('GOOGL_2004-08-01_2024-12-18.csv')

In [18]:
df1

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,2.502503,2.604104,2.401401,2.511011,2.501941,893181924
1,2004-08-20,2.527778,2.729730,2.515015,2.710460,2.700670,456686856
2,2004-08-23,2.771522,2.839840,2.728979,2.737738,2.727849,365122512
3,2004-08-24,2.783784,2.792793,2.591842,2.624374,2.614895,304946748
4,2004-08-25,2.626627,2.702703,2.599600,2.652653,2.643072,183772044
...,...,...,...,...,...,...,...
5113,2024-12-11,185.309998,195.610001,184.850006,195.399994,195.399994,67894100
5114,2024-12-12,195.000000,195.179993,191.710007,191.960007,191.960007,34817500
5115,2024-12-13,191.009995,192.729996,189.639999,189.820007,189.820007,25143500
5116,2024-12-16,192.869995,199.000000,192.619995,196.660004,196.660004,44934900
5117,2024-12-17,197.250000,201.419998,194.979996,195.419998,195.419998,43482900

In [22]:
df1.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2004-08-19  2.502503  2.604104  2.401401  2.511011   2.501941  893181924
1  2004-08-20  2.527778  2.729730  2.515015  2.710460   2.700670  456686856
2  2004-08-23  2.771522  2.839840  2.728979  2.737738   2.727849  365122512
3  2004-08-24  2.783784  2.792793  2.591842  2.624374   2.614895  304946748
4  2004-08-25  2.626627  2.702703  2.599600  2.652653   2.643072  183772044

In [28]:
df1.shape

(5118, 7)

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5118 entries, 0 to 5117
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   High       5118 non-null   float64
 1   Low        5118 non-null   float64
 2   Close      5118 non-null   float64
 3   Adj Close  5118 non-null   float64
 4   Volume     5118 non-null   int64
dtypes: float64(4), int64(1)
memory usage: 200.1 KB

In [46]:
df1

            High         Low       Close   Adj Close     Volume
0       2.604104    2.401401    2.511011    2.501941  893181924
1       2.729730    2.515015    2.710460    2.700670  456686856
2       2.839840    2.728979    2.737738    2.727849  365122512
3       2.792793    2.591842    2.624374    2.614895  304946748
4       2.702703    2.599600    2.652653    2.643072  183772044
...          ...         ...         ...         ...        ...
5113  195.610001  184.850006  195.399994  195.399994   67894100
5114  195.179993  191.710007  191.960007  191.960007   34817500
5115  192.729996  189.639999  189.820007  189.820007   25143500
5116  199.000000  192.619995  196.660004  196.660004   44934900
5117  201.419998  194.979996  195.419998  195.419998   43482900

[5118 rows x 5 columns]